{
  "nssactivities": [
    {
      "icon": "CheckCircle",
      "title": "Gandhi Jayanthi",
      "description": "As a part of Gandhi Jayanthi NSS volunteers of CAS Kottarakkara cleaned the meenpidipara waterfalls and surroundings."
    },
    {
      "icon": "CheckCircle",
      "title": "Mental Health Day Awareness",
      "description": "NSS Volunteers of CAS Kottarakkara conducted a mental health awareness program, debate competition and mental health games."
    },
    {
      "icon": "CheckCircle",
      "title": "Kerala Piravi Celebration",
      "description": "NSS volunteers of CAS Kottarakkara took a pledge, organized a quiz program and mono lingo competition."
    },
    {
      "icon": "CheckCircle",
      "title": "Constitution Day Celebration",
      "description": "NSS volunteers of CAS Kottarakkara has celebrated the constitution day by taking oath and conducted quiz competition."
    },
    {
      "icon": "CheckCircle",
      "title": "AIDS Day Awareness Program",
      "description": "NSS volunteers of CAS Kottarakkara has oragnised an awareness programme. The programme was lead by resource person Mrs. Rethi.S. Volunteers also conducted a short paper presentation and screened a movie which highlights the awareness about AIDS."
    },
    {
      "icon": "CheckCircle",
      "title": "Self Defence Class",
      "description": "Organized self defense class with Kerala Police for female students"
    },

    {
      "icon": "CheckCircle",
      "title": "Campus Cleaning",
      "description": "Cleaned the campus surroundings and made it plastic free."
    },
    {
      "icon": "CheckCircle",
      "title": "Youth Day Celebration",
      "description": "Celebrated National Youth day. Organized Wrestling challenge, Push-up challenge and Skipping Challenge"
    },
    {
      "icon": "CheckCircle",
      "title": "Blood Donation Camp",
      "description": "Participated in Blood donation camp organized by Kerala Police and SNSM NSS unit Elambalur."
    },
    {
      "icon": "CheckCircle",
      "title": "Republic Day",
      "description": "Participated in Republic day rally organized by Kottarakkara Taluk republic day committee and Kottarakkara Municipality."
    },
    {
      "icon": "CheckCircle",
      "title": "Valentines Day",
      "description": "Volunteers conducted and participated in different cultural programs like fancy dress competition, treasure hunt and make up man competition."
    },
    {
      "icon": "CheckCircle",
      "title": "Amirtham Pothichorr Vitharanam",
      "description": "Our Volunteers distributed lunch to the needy people. They distributed 30+ food packets to the people in Kottarakkara railway station and ganapathy temple."
    },
    {
      "icon": "CheckCircle",
      "title": "Mother Language Day",
      "description": "Students conducted and participated in different programs. They organised quiz competition, word building competition and elocution competition."
    },
    {
      "icon": "CheckCircle",
      "title": "World Wildlife Day and World Hearing Day",
      "description": "Conducted awareness class on how to protect our wildlife and also conducted awareness class to promote hearing care."
    }
  ]
}
