[
  {
    "id": 1,
    "title": "Training Program on Placement Grooming on September 29th, 2025",
    "description": "The College of Applied Science, Kottarakkara is organizing a Training Program on Placement Grooming to help students prepare for their career journey on September 29, 9:00 AM – 4:30 PM by Divya Raj (Professional Transformation Coach, Personality Development Executive at KKEM, Skill Development Executive at ASAP)\nStudents are encouraged to participate and make the most of this opportunity.",
    "date": "2025-09-23",
    "category": "Event",
    "documentUrl": "/documents/placement-training.pdf"
  },
  {
    "id": 2,
    "title": "PTA Meeting of Second Year Students from September 24th, 2025",
    "description": "This is to inform all parents that they are invited to meet with teachers between 10:00 AM and 3:00 PM. Your presence and participation are highly appreciated.",
    "date": "2025-09-23",
    "category": "Notice"
  },
  {
    "id": 3,
    "title": "College Union Election 2025-26",
    "description": "The college union election for the academic year 2025-26 will be held on October 10th, 2025. The nomination period ends on October 3rd, 2025. Voting will take place in the college from 10:00 AM to 1:00 PM on the election day",
    "date": "2025-09-23",
    "category": "Notice",
    "documentUrl": "/documents/collegeunionelection-notice.pdf"
  },
  {
    "id": 4,
    "title": "Guest Lecture on Artificial Intelligence",
    "description": "The Department of Computer Science is organizing a guest lecture on 'Future of Artificial Intelligence in Healthcare' by Dr. Priya Sharma, Senior Research Scientist at Google Research. The lecture is scheduled for September 30th, 2025 at 2:00 PM in the Main Auditorium. All students and faculty members are invited to attend. This session will cover latest developments in AI, machine learning applications in medical diagnosis, and career opportunities in AI research.",
    "date": "2025-09-22",
    "category": "Event"
  },
  {
    "id": 5,
    "title": "Fee Payment Deadline Extension",
    "description": "Due to technical issues with the online payment gateway, the semester fee payment deadline has been extended to October 5th, 2025. Students who have not yet paid their fees can do so through the college portal or visit the accounts office during working hours. Late fee charges will be waived for payments made by the extended deadline. For payment-related queries, contact the accounts department.",
    "date": "2025-09-21",
    "category": "Notice"
  },
  {
    "id": 6,
    "title": "Inter-College Sports Meet 2025",
    "description": "Our college is hosting the Inter-College Sports Meet 2025 from November 10-15, 2025. Events include athletics, football, basketball, volleyball, cricket, and indoor games. Students interested in participating should register with their respective department sports coordinators by October 1st, 2025. Training sessions will begin from October 5th. This is a great opportunity to represent our college and showcase sporting talents.",
    "date": "2025-09-20",
    "category": "Event"
  }
]
